{
  "__COMMON__": "Common translations",
  "hour": "hour",
  "hours": "hours",
  "index": "Menu",
  "english": "English",
  "spanish": "Spanish",

  "__VIEWS__": "Vistas",
  "home": {
    "subtitle": "Software Developer",
    "profile": {
        "title": "Profile",
        "text": "<p>For more than ten years I have been dedicated to the development of software and management applications. I started programming in <strong>Delphi</strong> and <strong>J2EE</strong> and I am currently focusing my attention on web-oriented technologies, such as <strong>HTML5</strong>, <strong>CSS3</strong>, <strong>jQuery</strong>, <strong>PHP</strong>, <strong>Linux</strong> and <strong>MySQL</strong>. Nowadays I develop applications in <strong>Angular</strong> and <strong>TypeScript</strong>, an ideal combination to create user interfaces. You can find out more about my work in my personal GitHub account:<br><br><a href=\"https://github.com/gchumillas\" target=\"_blank\"><i class=\"fa fa-external-link\"></i> github.com/gchumillas</a></p><p>If you want to request more information you can send me an email to <a href=\"mailto:{{email}}\">{{email}}</a>. I will get in touch with you as soon as possible.</p>"
    },
    "projects": {
      "title": "Projects",
      "photoManager": {
        "title": "Online photo manager",
        "text": "<p>I'm a photography enthusiast so I decided to create a personal project to organize my pictures. It is a \"first mobile\" application mainly developed in <strong>Angular</strong>, <strong>TypeScript</strong>, <strong>PHP</strong> and <strong>MySQL</strong>. It uses <strong>Dropbox</strong> as image storage system. You can find more about this project in GitHub:<br><br> <a href=\"https://github.com/gchumillas/petitphotobox\" target=\"_blank\"><i class=\"fa fa-external-link\"></i> github.com/gchumillas/petitphotobox</a></p>"
      },
      "cms": {
        "title": "Content Management System",
        "text": "<p>This application was born from the need of creating an \"Universal Content Manager System\". It is a highly configurable application capable of managing the content of any website, no matter how it was developed. The application was mainly developed in <strong>jQuery</strong>, <strong>PHP</strong> and <strong>MySQL</strong>. Here's a demo:<br><br> <a href=\"http://gchumillas.com/cms/\" target=\"_blank\"><i class=\"fa fa-external-link\"></i> gchumillas.com/cms</a></p>"
      }
    },
    "howWorks": {
      "title": "How does it work?",
      "text": "The software development process is divided into several stages, and maintaining a constant contact with the client is crucial to ensure an adequate direction.",
      "requirements": {
        "title": "Compilation of requirements",
        "text": "During this first stage the communication begins. It pretends to establish the purpose as well as the requirements of the application. We can use Skype, email or other software to start conversations."
      },
      "design": {
        "title": "Templates design",
        "text": "Before starting the development stage it's very important to determine which screens will conform the application and their interaction between them. To achieve this a set of templates will be designed, subject to the client approval."
      },
      "development": {
        "title": "Development",
        "text": "Once the client has agreed the design we will start the development stage. It basically consists in \"bringing to reality\" the templates designed in the previous stage. Advances will be published regularly, so that the client can see the progress of the application."
      },
      "installation": {
        "title": "Delivering and installation",
        "text": "Finally the application is delivered and installed on the client's server. I can provide a server in case the client does not have one."
      }
    },
    "howMuch": {
      "title": "How much does it cost?",
      "text": "<p><strong>My current rate is 45€ per hour and each development stage is billed and paid independently</strong>. As an illustrative example let's say that we have a blog and we want to manage their entries. The application must be able to <code>list</code>, <code>delete</code>, <code>edit</code> or <code>insert</code> entries. In total there are four screens, including the log-in screen.</p><p><strong>I would like to note that the following cost breakdown is illustrative only.</strong> Each application has its own peculiarities. But it seemed to me appropriate to illustrate with an example how much a simple application would cost.</p>"
    },
    "contact": {
      "title": "Contact"
    },
    "details": {
      "mainTemplate": "Main template",
      "editTemplate": "Edit template",
      "insertTemplate": "Insert template",
      "loginTemplate": "Login template",
      "mainScreen": "Main screen",
      "editScreen": "Edit screen",
      "insertScreen": "Insert screen",
      "loginScreen": "Login screen"
    }
  }
}
